                        .include         "sm_macros.s"
                        .include         "bb_macros.s"
#=======================================================================================================================
# strings
                        .section         .rodata
.S0:                    .string          "nl"
.S1:                    .string          "ALPHABET"
.S2:                    .string          "list(head,tail)"
.S3:                    .string          "DATA"
.S4:                    .string          "frame_id"
.S5:                    .string          "TABLE"
.S6:                    .string          "stk_tag"
.S7:                    .string          "stk_n"
.S8:                    .string          "stk_c"
.S9:                    .string          "stk_push_frame(v)"
.S10:                   .string          "DEFINE"
.S11:                   .string          "stk_push_frame"
.S12:                   .string          "v"
.S13:                   .string          "IDX_SET"
.S14:                   .string          "stk"
.S15:                   .string          "list"
.S16:                   .string          "dummy"
.S17:                   .string          "NAME_PUSH"
.S18:                   .string          "stk_push_frame_end"
.S19:                   .string          "stk_push_item(v,cur)"
.S20:                   .string          "stk_push_item"
.S21:                   .string          "head"
.S22:                   .string          "cur"
.S23:                   .string          "IDX"
.S24:                   .string          "stk_push_item_end"
.S25:                   .string          "stk_pop_into_parent(child,par,n)"
.S26:                   .string          "stk_pop_into_parent"
.S27:                   .string          "child"
.S28:                   .string          "tail"
.S29:                   .string          "par"
.S30:                   .string          "n"
.S31:                   .string          "stk_pop_into_parent_end"
.S32:                   .string          "stk_pop_final(var,child)"
.S33:                   .string          "stk_pop_final"
.S34:                   .string          "var"
.S35:                   .string          "ASGN_INDIR"
.S36:                   .string          "stk_pop_final_end"
.S37:                   .string          "init_list(v)"
.S38:                   .string          "Init_list(vs)"
.S39:                   .string          "init_list"
.S40:                   .string          ""
.S41:                   .string          "Init_list"
.S42:                   .string          "epsilon . *init_list("
.S43:                   .string          "vs"
.S44:                   .string          ")"
.S45:                   .string          "EVAL"
.S46:                   .string          "init_list_end"
.S47:                   .string          "push_list(v)"
.S48:                   .string          "Push_list(vs)"
.S49:                   .string          "push_list"
.S50:                   .string          "Push_list"
.S51:                   .string          "epsilon . *push_list("
.S52:                   .string          "push_list_end"
.S53:                   .string          "push_item(v)"
.S54:                   .string          "Push_item(vs)"
.S55:                   .string          "push_item"
.S56:                   .string          "Push_item"
.S57:                   .string          "epsilon . *push_item("
.S58:                   .string          "push_item_end"
.S59:                   .string          "pop_list()"
.S60:                   .string          "Pop_list()"
.S61:                   .string          "pop_list"
.S62:                   .string          "Pop_list"
.S63:                   .string          "epsilon"
.S64:                   .string          "pop_list_end"
.S65:                   .string          "pop_final(v)"
.S66:                   .string          "Pop_final(vs)"
.S67:                   .string          "pop_final"
.S68:                   .string          "Pop_final"
.S69:                   .string          "epsilon . *pop_final("
.S70:                   .string          "pop_final_end"
.S71:                   .string          "node_repr(f)r,sep,i,n,tag"
.S72:                   .string          "node_repr"
.S73:                   .string          "f"
.S74:                   .string          "DATATYPE"
.S75:                   .string          "LCASE"
.S76:                   .string          "UCASE"
.S77:                   .string          "REPLACE"
.S78:                   .string          "STRING"
.S79:                   .string          "IDENT"
.S80:                   .string          "'"
.S81:                   .string          "nr_frame"
.S82:                   .string          "tag"
.S83:                   .string          "('"
.S84:                   .string          "r"
.S85:                   .string          "i"
.S86:                   .string          "nr_lp"
.S87:                   .string          "LT"
.S88:                   .string          ", "
.S89:                   .string          "nr_done"
.S90:                   .string          "node_repr_end"
.S91:                   .string          "pp_node(f,indent,suffix)r,pad,tag,n,i,nxt"
.S92:                   .string          "pp_node"
.S93:                   .string          " "
.S94:                   .string          "indent"
.S95:                   .string          "DUPL"
.S96:                   .string          "suffix"
.S97:                   .string          "OUTPUT"
.S98:                   .string          "pp_frame"
.S99:                   .string          "pad"
.S100:                  .string          "SIZE"
.S101:                  .string          "GT"
.S102:                  .string          "pp_wrap"
.S103:                  .string          "( "
.S104:                  .string          "',"
.S105:                  .string          "pp_wch"
.S106:                  .string          "nxt"
.S107:                  .string          ","
.S108:                  .string          "pp_wlast"
.S109:                  .string          "pp_wdone"
.S110:                  .string          "pp_node_end"
.S111:                  .string          "pp_bank()"
.S112:                  .string          "pp_bank"
.S113:                  .string          "bank"
.S114:                  .string          "pp_bank_end"
.S115:                  .string          "delim"
.S116:                  .string          "( )"
.S117:                  .string          "word"
.S118:                  .string          "("
.S119:                  .string          "group"
.S120:                  .string          "wrd"
.S121:                  .string          "BAL"
.S122:                  .string          "item"
.S123:                  .string          "spat"
.S124:                  .string          "slurp"
.S125:                  .string          "INPUT"
.S126:                  .string          "line"
.S127:                  .string          "src"
.S128:                  .string          "slurp_done"
.S129:                  .string          "BANK"
.S130:                  .string          "loop"
.S131:                  .string          "ROOT"
.S132:                  .string          "parse_fail"
.S133:                  .string          "Parse failed on: "
.S134:                  .string          "all_done"
.S135:                  .string          "END"
                        .text
#=======================================================================================================================
# expression registry
                        .section         .data
                        .align           8
.Lchunk_registry:       .quad            .S11             ; .quad            .L32
                        .quad            .S18             ; .quad            .L63
                        .quad            .S20             ; .quad            .L70
                        .quad            .S24             ; .quad            .L98
                        .quad            .S26             ; .quad            .L105
                        .quad            .S31             ; .quad            .L145
                        .quad            .S33             ; .quad            .L152
                        .quad            .S36             ; .quad            .L170
                        .quad            .S39             ; .quad            .L181
                        .quad            .S41             ; .quad            .L206
                        .quad            .S46             ; .quad            .L216
                        .quad            .S49             ; .quad            .L227
                        .quad            .S50             ; .quad            .L237
                        .quad            .S52             ; .quad            .L247
                        .quad            .S55             ; .quad            .L258
                        .quad            .S56             ; .quad            .L268
                        .quad            .S58             ; .quad            .L278
                        .quad            .S61             ; .quad            .L289
                        .quad            .S62             ; .quad            .L298
                        .quad            .S64             ; .quad            .L306
                        .quad            .S67             ; .quad            .L317
                        .quad            .S68             ; .quad            .L327
                        .quad            .S70             ; .quad            .L337
                        .quad            .S72             ; .quad            .L344
                        .quad            .S81             ; .quad            .L363
                        .quad            .S86             ; .quad            .L384
                        .quad            .S89             ; .quad            .L411
                        .quad            .S90             ; .quad            .L418
                        .quad            .S92             ; .quad            .L425
                        .quad            .S98             ; .quad            .L450
                        .quad            .S102            ; .quad            .L477
                        .quad            .S105            ; .quad            .L502
                        .quad            .S108            ; .quad            .L537
                        .quad            .S109            ; .quad            .L553
                        .quad            .S110            ; .quad            .L556
                        .quad            .S112            ; .quad            .L563
                        .quad            .S114            ; .quad            .L575
                        .quad            .S124            ; .quad            .L636
                        .quad            .S128            ; .quad            .L649
                        .quad            .S130            ; .quad            .L659
                        .quad            .S132            ; .quad            .L682
                        .quad            .S134            ; .quad            .L692
                        .quad            .S135            ; .quad            .L701
                        .quad            0                ; .quad            0
                        .text
#=======================================================================================================================
# BB code
                        .intel_syntax    noprefix
                        .text
#=======================================================================================================================
# pattern pat_inv_0: POS(0) LEN(0) . <var>
#=======================================================================================================================
                        .global          pat_inv_0_α
                        .global          pat_inv_0_β
                        .global          pat_inv_0_γ
                        .global          pat_inv_0_ω
pat_inv_0_α:            lea              r10, [rip + Δ]
                        cmp              esi, 0;                    je pat_inv_0_α_body; jmp pat_inv_0_β
#-----------------------------------------------------------------------------------------------------------------------
# BOX POS(0)  [xcat0_γ]
pat_inv_0_α_body:       POS_α            0, xcat0_γ, xcat0_ω # POS(0)
xcat0_left_β:           POS_β            xcat0_ω
#-----------------------------------------------------------------------------------------------------------------------
# BOX CAP_COND  [pat_inv_0_γ]
# data: .Lcap1_vname, .Lcap1_data
xcat0_γ:                .globl           cap1_child_α
cap1_child_α:           lea              r10, [rip + Δ]
                        cmp              esi, 0;                    je cap1_α_body; jmp cap1_β
#-----------------------------------------------------------------------------------------------------------------------
# BOX LEN(0)  [cap1_γ]
# data: .Llen2_z
cap1_α_body:            lea              rdi, [rip + .Llen2_z]
                        mov              esi, 0
                        call             bb_len@PLT
                        test             rax, rax;                  jne cap1_γ; jmp cap1_ω
cap1_β:                 lea              rdi, [rip + .Llen2_z]
                        mov              esi, 1
                        call             bb_len@PLT
                        test             rax, rax;                  jne cap1_γ; jmp cap1_ω
cap1_γ:                 lea              rcx, [rip + Σ]
                        mov              rax, [rcx]
                        movsxd           rcx, dword ptr [r10]
                        lea              rax, [rax+rcx]
                        mov              rdx, rax
                        mov              eax, 1
                        ret
cap1_ω:                 mov              eax, 99
                        xor              edx, edx
                        ret
                        lea              rdi, [rip + .Lcap1_data]
                        mov              esi, 0
                        call             bb_cap@PLT
                        test             rax, rax;                  jne pat_inv_0_γ; jmp xcat0_right_ω
xcat0_right_β:          lea              rdi, [rip + .Lcap1_data]
                        mov              esi, 1
                        call             bb_cap@PLT
                        test             rax, rax;                  jne pat_inv_0_γ; jmp xcat0_right_ω
xcat0_right_ω:                                                      jmp xcat0_left_β
pat_inv_0_β:                                                        jmp xcat0_right_β
xcat0_ω:                                                            jmp pat_inv_0_ω
pat_inv_0_γ:            lea              rcx, [rip + Σ]
                        mov              rax, [rcx]
                        movsxd           rcx, dword ptr [r10]
                        lea              rax, [rax+rcx]
                        mov              rdx, rax
                        mov              eax, 1
                        ret
pat_inv_0_ω:            mov              eax, 99
                        xor              edx, edx
                        ret
                        .section         .data
.Lcap1_vname:           .string          ""
.Lcap1_data:            .quad            0
                        .quad            0
                        .long            0
                        .long            0
                        .long            0
                        .long            0
                        .quad            .Lcap1_vname
                        .zero            56
                        .zero            24
.Llen2_z:               .long            0
                        .section         .text
#=======================================================================================================================
# SM code
                        .intel_syntax    noprefix
                        .globl           main
                        .type            main, @function
main:                   push             rbp
                        mov              rbp, rsp
                        lea              rdi, [rip + .Lchunk_registry]
                        call             rt_register_expressions@PLT
                        lea              rdi, [rip + .Lcap1_data]
                        lea              rsi, [rip + cap1_child_α]
                        call             rt_patch_cap_fn@PLT
                        call             rt_init@PLT # rt_init(argc, argv)
#=======================================================================================================================
# stmt 1  (line 6):                 &ALPHABET      POS(10) LEN(1) . nl
#=======================================================================================================================
.L0:                    STNO
                        # PUSH_INT       baked  pat_inv_0 pc=1..6
                        # PAT_POS        baked  pat_inv_0 pc=1..6
                        # PUSH_INT       baked  pat_inv_0 pc=1..6
                        # PAT_LEN        baked  pat_inv_0 pc=1..6
                        # PAT_CAPTURE    baked  pat_inv_0 pc=1..6
                        # PAT_CAT        baked  pat_inv_0 pc=1..6
                        PUSH_VAR         .S1 # ALPHABET
                        PUSH_INT         0
                        lea              rdi, [rip + pat_inv_0_α]
                        lea              rsi, [rip + .S1]
                        mov              edx, 0
                        call             rt_match_blob@PLT
#=======================================================================================================================
# stmt 2  (line 8):                 DATA('list(head,tail)')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S2, 0 # "list(head,tail)"
                        CALL_FN          .S3, 1 # DATA
                        VOID_POP
#=======================================================================================================================
# stmt 3  (line 9):                 frame_id       =  0
#=======================================================================================================================
                        STNO
                        PUSH_INT         0
                        STORE_VAR        .S4 # frame_id
#=======================================================================================================================
# stmt 4  (line 10):                 stk_tag        =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        STORE_VAR        .S6 # stk_tag
#=======================================================================================================================
# stmt 5  (line 11):                 stk_n          =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        STORE_VAR        .S7 # stk_n
#=======================================================================================================================
# stmt 6  (line 12):                 stk_c          =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        STORE_VAR        .S8 # stk_c
#=======================================================================================================================
# stmt 7  (line 14):                 DEFINE('stk_push_frame(v)')                  :(stk_push_frame_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S9, 0 # "stk_push_frame(v)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L62
                        LABEL
#=======================================================================================================================
# stmt 8  (line 15):  stk_push_frame frame_id              =  frame_id + 1
#=======================================================================================================================
.L32:                   STNO
                        PUSH_VAR         .S4 # frame_id
                        PUSH_INT         1
                        ADD_NUM
                        STORE_VAR        .S4 # frame_id
#=======================================================================================================================
# stmt 9  (line 16):                 stk_tag[frame_id]    =  v
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S12 # v
                        PUSH_VAR         .S6 # stk_tag
                        PUSH_VAR         .S4 # frame_id
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 10  (line 17):                 stk_n[frame_id]      =  0
#=======================================================================================================================
                        STNO
                        PUSH_INT         0
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S4 # frame_id
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 11  (line 18):                 stk_c[frame_id]      =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        PUSH_VAR         .S8 # stk_c
                        PUSH_VAR         .S4 # frame_id
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 12  (line 19):                 stk                  =  list(frame_id, stk)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S4 # frame_id
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S15, 2 # list
                        STORE_VAR        .S14 # stk
#=======================================================================================================================
# stmt 13  (line 20):                 stk_push_frame       =  .dummy               :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S11 # stk_push_frame
                        RETURN
.L62:                   LABEL
#=======================================================================================================================
# stmt 14  (line 22):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L63:                   STNO
#=======================================================================================================================
# stmt 15  (line 23):                 DEFINE('stk_push_item(v,cur)')               :(stk_push_item_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S19, 0 # "stk_push_item(v,cur)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L97
                        LABEL
#=======================================================================================================================
# stmt 16  (line 24):  stk_push_item  cur                  =  head(stk)
#=======================================================================================================================
.L70:                   STNO
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S21, 1 # head
                        STORE_VAR        .S22 # cur
#=======================================================================================================================
# stmt 17  (line 25):                 stk_n[cur]           =  stk_n[cur] + 1
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S22 # cur
                        CALL_FN          .S23, 2 # IDX
                        PUSH_INT         1
                        ADD_NUM
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S22 # cur
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 18  (line 26):                 stk_c[cur][stk_n[cur]] =  v
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S12 # v
                        PUSH_VAR         .S8 # stk_c
                        PUSH_VAR         .S22 # cur
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S22 # cur
                        CALL_FN          .S23, 2 # IDX
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 19  (line 27):                 stk_push_item        =  .dummy               :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S20 # stk_push_item
                        RETURN
.L97:                   LABEL
#=======================================================================================================================
# stmt 20  (line 29):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L98:                   STNO
#=======================================================================================================================
# stmt 21  (line 30):                 DEFINE('stk_pop_into_parent(child,par,n)')   :(stk_pop_into_parent_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S25, 0 # "stk_pop_into_parent(child,par,n)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L144
                        LABEL
#=======================================================================================================================
# stmt 22  (line 32):                 child                =  head(stk)
#=======================================================================================================================
.L105:                  STNO
#=======================================================================================================================
# stmt 23  (line 32):                 child                =  head(stk)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S21, 1 # head
                        STORE_VAR        .S27 # child
#=======================================================================================================================
# stmt 24  (line 33):                 stk                  =  tail(stk)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S28, 1 # tail
                        STORE_VAR        .S14 # stk
#=======================================================================================================================
# stmt 25  (line 34):                 par                  =  head(stk)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S21, 1 # head
                        STORE_VAR        .S29 # par
#=======================================================================================================================
# stmt 26  (line 35):                 n                    =  stk_n[par]
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S29 # par
                        CALL_FN          .S23, 2 # IDX
                        STORE_VAR        .S30 # n
#=======================================================================================================================
# stmt 27  (line 36):                 stk_n[par]           =  n + 1
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S30 # n
                        PUSH_INT         1
                        ADD_NUM
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S29 # par
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 28  (line 37):                 stk_c[par][n + 1]    =  child
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S27 # child
                        PUSH_VAR         .S8 # stk_c
                        PUSH_VAR         .S29 # par
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S30 # n
                        PUSH_INT         1
                        ADD_NUM
                        CALL_FN          .S13, 3 # IDX_SET
#=======================================================================================================================
# stmt 29  (line 38):                 stk_pop_into_parent  =  .dummy               :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S26 # stk_pop_into_parent
                        RETURN
.L144:                  LABEL
#=======================================================================================================================
# stmt 30  (line 40):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L145:                  STNO
#=======================================================================================================================
# stmt 31  (line 41):                 DEFINE('stk_pop_final(var,child)')           :(stk_pop_final_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S32, 0 # "stk_pop_final(var,child)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L169
                        LABEL
#=======================================================================================================================
# stmt 32  (line 42):  stk_pop_final  child                =  head(stk)
#=======================================================================================================================
.L152:                  STNO
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S21, 1 # head
                        STORE_VAR        .S27 # child
#=======================================================================================================================
# stmt 33  (line 43):                 stk                  =  tail(stk)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S14 # stk
                        CALL_FN          .S28, 1 # tail
                        STORE_VAR        .S14 # stk
#=======================================================================================================================
# stmt 34  (line 44):                 $var                 =  child
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S27 # child
                        PUSH_VAR         .S34 # var
                        CALL_FN          .S35, 2 # ASGN_INDIR
#=======================================================================================================================
# stmt 35  (line 45):                 stk_pop_final        =  .dummy               :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S33 # stk_pop_final
                        RETURN
.L169:                  LABEL
#=======================================================================================================================
# stmt 36  (line 47):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L170:                  STNO
#=======================================================================================================================
# stmt 37  (line 48):                 DEFINE('init_list(v)')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S37, 0 # "init_list(v)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
#=======================================================================================================================
# stmt 38  (line 49):                 DEFINE('Init_list(vs)')                      :(init_list_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S38, 0 # "Init_list(vs)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L215
                        LABEL
#=======================================================================================================================
# stmt 39  (line 50):  init_list      $v             =
#=======================================================================================================================
.L181:                  STNO
                        PUSH_STR         .S40, 0 # ""
                        PUSH_VAR         .S12 # v
                        CALL_FN          .S35, 2 # ASGN_INDIR
#=======================================================================================================================
# stmt 40  (line 51):                 stk            =
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S40, 0 # ""
                        STORE_VAR        .S14 # stk
#=======================================================================================================================
# stmt 41  (line 52):                 frame_id       =  0
#=======================================================================================================================
                        STNO
                        PUSH_INT         0
                        STORE_VAR        .S4 # frame_id
#=======================================================================================================================
# stmt 42  (line 53):                 stk_tag        =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        STORE_VAR        .S6 # stk_tag
#=======================================================================================================================
# stmt 43  (line 54):                 stk_n          =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        STORE_VAR        .S7 # stk_n
#=======================================================================================================================
# stmt 44  (line 55):                 stk_c          =  TABLE()
#=======================================================================================================================
                        STNO
                        CALL_FN          .S5, 0 # TABLE
                        STORE_VAR        .S8 # stk_c
#=======================================================================================================================
# stmt 45  (line 56):                 init_list      =  .dummy                     :(NRETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S39 # init_list
                        RETURN_VARIANT   2, 0, 204 # SM_NRETURN
                        LABEL
#=======================================================================================================================
# stmt 46  (line 57):  Init_list      Init_list      =  EVAL('epsilon . *init_list(' vs ')')  :(RETURN)
#=======================================================================================================================
.L206:                  STNO
                        PUSH_STR         .S42, 0 # "epsilon . *init_list("
                        PUSH_VAR         .S43 # vs
                        PUSH_STR         .S44, 0 # ")"
                        CONCAT
                        CONCAT
                        CALL_FN          .S45, 1 # EVAL
                        STORE_VAR        .S41 # Init_list
                        RETURN
.L215:                  LABEL
#=======================================================================================================================
# stmt 47  (line 59):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L216:                  STNO
#=======================================================================================================================
# stmt 48  (line 60):                 DEFINE('push_list(v)')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S47, 0 # "push_list(v)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
#=======================================================================================================================
# stmt 49  (line 61):                 DEFINE('Push_list(vs)')                      :(push_list_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S48, 0 # "Push_list(vs)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L246
                        LABEL
#=======================================================================================================================
# stmt 50  (line 62):  push_list      dummy          =  stk_push_frame(v)
#=======================================================================================================================
.L227:                  STNO
                        PUSH_VAR         .S12 # v
                        CALL_FN          .S11, 1 # stk_push_frame
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 51  (line 63):                 push_list      =  .dummy                     :(NRETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S49 # push_list
                        RETURN_VARIANT   2, 0, 235 # SM_NRETURN
                        LABEL
#=======================================================================================================================
# stmt 52  (line 64):  Push_list      Push_list      =  EVAL('epsilon . *push_list(' vs ')')  :(RETURN)
#=======================================================================================================================
.L237:                  STNO
                        PUSH_STR         .S51, 0 # "epsilon . *push_list("
                        PUSH_VAR         .S43 # vs
                        PUSH_STR         .S44, 0 # ")"
                        CONCAT
                        CONCAT
                        CALL_FN          .S45, 1 # EVAL
                        STORE_VAR        .S50 # Push_list
                        RETURN
.L246:                  LABEL
#=======================================================================================================================
# stmt 53  (line 66):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L247:                  STNO
#=======================================================================================================================
# stmt 54  (line 67):                 DEFINE('push_item(v)')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S53, 0 # "push_item(v)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
#=======================================================================================================================
# stmt 55  (line 68):                 DEFINE('Push_item(vs)')                      :(push_item_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S54, 0 # "Push_item(vs)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L277
                        LABEL
#=======================================================================================================================
# stmt 56  (line 69):  push_item      dummy          =  stk_push_item(v)
#=======================================================================================================================
.L258:                  STNO
                        PUSH_VAR         .S12 # v
                        CALL_FN          .S20, 1 # stk_push_item
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 57  (line 70):                 push_item      =  .dummy                     :(NRETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S55 # push_item
                        RETURN_VARIANT   2, 0, 266 # SM_NRETURN
                        LABEL
#=======================================================================================================================
# stmt 58  (line 71):  Push_item      Push_item      =  EVAL('epsilon . *push_item(' vs ')')  :(RETURN)
#=======================================================================================================================
.L268:                  STNO
                        PUSH_STR         .S57, 0 # "epsilon . *push_item("
                        PUSH_VAR         .S43 # vs
                        PUSH_STR         .S44, 0 # ")"
                        CONCAT
                        CONCAT
                        CALL_FN          .S45, 1 # EVAL
                        STORE_VAR        .S56 # Push_item
                        RETURN
.L277:                  LABEL
#=======================================================================================================================
# stmt 59  (line 73):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L278:                  STNO
#=======================================================================================================================
# stmt 60  (line 74):                 DEFINE('pop_list()')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S59, 0 # "pop_list()"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
#=======================================================================================================================
# stmt 61  (line 75):                 DEFINE('Pop_list()')                         :(pop_list_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S60, 0 # "Pop_list()"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L305
                        LABEL
#=======================================================================================================================
# stmt 62  (line 76):  pop_list       dummy          =  stk_pop_into_parent()
#=======================================================================================================================
.L289:                  STNO
                        CALL_FN          .S26, 0 # stk_pop_into_parent
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 63  (line 77):                 pop_list       =  .dummy                     :(NRETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S61 # pop_list
                        RETURN_VARIANT   2, 0, 296 # SM_NRETURN
                        LABEL
#=======================================================================================================================
# stmt 64  (line 78):  Pop_list       Pop_list       =  epsilon . *pop_list()      :(RETURN)
#=======================================================================================================================
.L298:                  STNO
                        PUSH_VAR         .S63 # epsilon
                        PAT_DEREF
                        PAT_CAPTURE_FN   0, .S61 # pop_list, (NULL)
                        PAT_BOXVAL
                        STORE_VAR        .S62 # Pop_list
                        RETURN
.L305:                  LABEL
#=======================================================================================================================
# stmt 65  (line 80):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L306:                  STNO
#=======================================================================================================================
# stmt 66  (line 81):                 DEFINE('pop_final(v)')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S65, 0 # "pop_final(v)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
#=======================================================================================================================
# stmt 67  (line 82):                 DEFINE('Pop_final(vs)')                      :(pop_final_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S66, 0 # "Pop_final(vs)"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L336
                        LABEL
#=======================================================================================================================
# stmt 68  (line 83):  pop_final      dummy          =  stk_pop_final(v)
#=======================================================================================================================
.L317:                  STNO
                        PUSH_VAR         .S12 # v
                        CALL_FN          .S33, 1 # stk_pop_final
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 69  (line 84):                 pop_final      =  .dummy                     :(NRETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S67 # pop_final
                        RETURN_VARIANT   2, 0, 325 # SM_NRETURN
                        LABEL
#=======================================================================================================================
# stmt 70  (line 85):  Pop_final      Pop_final      =  EVAL('epsilon . *pop_final(' vs ')')  :(RETURN)
#=======================================================================================================================
.L327:                  STNO
                        PUSH_STR         .S69, 0 # "epsilon . *pop_final("
                        PUSH_VAR         .S43 # vs
                        PUSH_STR         .S44, 0 # ")"
                        CONCAT
                        CONCAT
                        CALL_FN          .S45, 1 # EVAL
                        STORE_VAR        .S68 # Pop_final
                        RETURN
.L336:                  LABEL
#=======================================================================================================================
# stmt 71  (line 87):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L337:                  STNO
#=======================================================================================================================
# stmt 72  (line 88):                 DEFINE('node_repr(f)r,sep,i,n,tag')          :(node_repr_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S71, 0 # "node_repr(f)r,sep,i,n,tag"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L417
                        LABEL
#=======================================================================================================================
# stmt 73  (line 89):  node_repr      IDENT(REPLACE(DATATYPE(f), &LCASE, &UCASE), 'STRING')  :F(nr_frame)
#=======================================================================================================================
.L344:                  STNO
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S74, 1 # DATATYPE
                        PUSH_VAR         .S75 # LCASE
                        PUSH_VAR         .S76 # UCASE
                        CALL_FN          .S77, 3 # REPLACE
                        PUSH_STR         .S78, 0 # "STRING"
                        CALL_FN          .S79, 2 # IDENT
                        VOID_POP
                        JUMP_F           .L362
#=======================================================================================================================
# stmt 74  (line 90):                 node_repr      =  "'" f "'"                  :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S80, 0 # "'"
                        PUSH_VAR         .S73 # f
                        PUSH_STR         .S80, 0 # "'"
                        CONCAT
                        CONCAT
                        STORE_VAR        .S72 # node_repr
                        RETURN
.L362:                  LABEL
#=======================================================================================================================
# stmt 75  (line 91):  nr_frame       tag            =  stk_tag[f]
#=======================================================================================================================
.L363:                  STNO
                        PUSH_VAR         .S6 # stk_tag
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        STORE_VAR        .S82 # tag
#=======================================================================================================================
# stmt 76  (line 92):                 n              =  stk_n[f]
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        STORE_VAR        .S30 # n
#=======================================================================================================================
# stmt 77  (line 93):                 r              =  "('" tag "'"
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S83, 0 # "('"
                        PUSH_VAR         .S82 # tag
                        PUSH_STR         .S80, 0 # "'"
                        CONCAT
                        CONCAT
                        STORE_VAR        .S84 # r
#=======================================================================================================================
# stmt 78  (line 94):                 i              =  0
#=======================================================================================================================
                        STNO
                        PUSH_INT         0
                        STORE_VAR        .S85 # i
.L383:                  LABEL
#=======================================================================================================================
# stmt 79  (line 95):  nr_lp          i              =  LT(i, n) i + 1             :F(nr_done)
#=======================================================================================================================
.L384:                  STNO
                        PUSH_VAR         .S85 # i
                        PUSH_VAR         .S30 # n
                        CALL_FN          .S87, 2 # LT
                        PUSH_VAR         .S85 # i
                        PUSH_INT         1
                        ADD_NUM
                        CONCAT
                        STORE_VAR        .S85 # i
                        JUMP_F           .L410
#=======================================================================================================================
# stmt 80  (line 96):                 r              =  r ', ' node_repr(stk_c[f][i])
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S84 # r
                        PUSH_STR         .S88, 0 # ", "
                        PUSH_VAR         .S8 # stk_c
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S85 # i
                        CALL_FN          .S23, 2 # IDX
                        CALL_FN          .S72, 1 # node_repr
                        CONCAT
                        CONCAT
                        STORE_VAR        .S84 # r
#=======================================================================================================================
# stmt 81  (line 97):                 i              =  i                          :(nr_lp)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S85 # i
                        STORE_VAR        .S85 # i
                        JUMP             .L383
.L410:                  LABEL
#=======================================================================================================================
# stmt 82  (line 98):  nr_done        node_repr      =  r ')'                      :(RETURN)
#=======================================================================================================================
.L411:                  STNO
                        PUSH_VAR         .S84 # r
                        PUSH_STR         .S44, 0 # ")"
                        CONCAT
                        STORE_VAR        .S72 # node_repr
                        RETURN
.L417:                  LABEL
#=======================================================================================================================
# stmt 83  (line 100):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L418:                  STNO
#=======================================================================================================================
# stmt 84  (line 101):                 DEFINE('pp_node(f,indent,suffix)r,pad,tag,n,i,nxt') :(pp_node_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S91, 0 # "pp_node(f,indent,suffix)r,pad,tag,n,i,nx..."
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L555
                        LABEL
#=======================================================================================================================
# stmt 85  (line 102):  pp_node        IDENT(REPLACE(DATATYPE(f), &LCASE, &UCASE), 'STRING')  :F(pp_frame)
#=======================================================================================================================
.L425:                  STNO
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S74, 1 # DATATYPE
                        PUSH_VAR         .S75 # LCASE
                        PUSH_VAR         .S76 # UCASE
                        CALL_FN          .S77, 3 # REPLACE
                        PUSH_STR         .S78, 0 # "STRING"
                        CALL_FN          .S79, 2 # IDENT
                        VOID_POP
                        JUMP_F           .L449
#=======================================================================================================================
# stmt 86  (line 103):                 OUTPUT         =  DUPL(' ', indent) "'" f "'" suffix  :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S93, 0 # " "
                        PUSH_VAR         .S94 # indent
                        CALL_FN          .S95, 2 # DUPL
                        PUSH_STR         .S80, 0 # "'"
                        PUSH_VAR         .S73 # f
                        PUSH_STR         .S80, 0 # "'"
                        PUSH_VAR         .S96 # suffix
                        CONCAT
                        CONCAT
                        CONCAT
                        CONCAT
                        STORE_VAR        .S97 # OUTPUT
                        RETURN
.L449:                  LABEL
#=======================================================================================================================
# stmt 87  (line 104):  pp_frame       r              =  node_repr(f)
#=======================================================================================================================
.L450:                  STNO
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S72, 1 # node_repr
                        STORE_VAR        .S84 # r
#=======================================================================================================================
# stmt 88  (line 105):                 pad            =  DUPL(' ', indent)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S93, 0 # " "
                        PUSH_VAR         .S94 # indent
                        CALL_FN          .S95, 2 # DUPL
                        STORE_VAR        .S99 # pad
#=======================================================================================================================
# stmt 89  (line 106):                 GT(80, indent + SIZE(r))                     :F(pp_wrap)
#=======================================================================================================================
                        STNO
                        PUSH_INT         80
                        PUSH_VAR         .S94 # indent
                        PUSH_VAR         .S84 # r
                        CALL_FN          .S100, 1 # SIZE
                        ADD_NUM
                        CALL_FN          .S101, 2 # GT
                        VOID_POP
                        JUMP_F           .L476
#=======================================================================================================================
# stmt 90  (line 107):                 OUTPUT         =  pad r suffix               :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S99 # pad
                        PUSH_VAR         .S84 # r
                        PUSH_VAR         .S96 # suffix
                        CONCAT
                        CONCAT
                        STORE_VAR        .S97 # OUTPUT
                        RETURN
.L476:                  LABEL
#=======================================================================================================================
# stmt 91  (line 108):  pp_wrap        tag            =  stk_tag[f]
#=======================================================================================================================
.L477:                  STNO
                        PUSH_VAR         .S6 # stk_tag
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        STORE_VAR        .S82 # tag
#=======================================================================================================================
# stmt 92  (line 109):                 n              =  stk_n[f]
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S7 # stk_n
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        STORE_VAR        .S30 # n
#=======================================================================================================================
# stmt 93  (line 110):                 OUTPUT         =  pad '( ' "'" tag "',"
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S99 # pad
                        PUSH_STR         .S103, 0 # "( "
                        PUSH_STR         .S80, 0 # "'"
                        PUSH_VAR         .S82 # tag
                        PUSH_STR         .S104, 0 # "',"
                        CONCAT
                        CONCAT
                        CONCAT
                        CONCAT
                        STORE_VAR        .S97 # OUTPUT
#=======================================================================================================================
# stmt 94  (line 111):                 i              =  0
#=======================================================================================================================
                        STNO
                        PUSH_INT         0
                        STORE_VAR        .S85 # i
.L501:                  LABEL
#=======================================================================================================================
# stmt 95  (line 112):  pp_wch         i              =  LT(i, n) i + 1             :F(pp_wdone)
#=======================================================================================================================
.L502:                  STNO
                        PUSH_VAR         .S85 # i
                        PUSH_VAR         .S30 # n
                        CALL_FN          .S87, 2 # LT
                        PUSH_VAR         .S85 # i
                        PUSH_INT         1
                        ADD_NUM
                        CONCAT
                        STORE_VAR        .S85 # i
                        JUMP_F           .L552
#=======================================================================================================================
# stmt 96  (line 113):                 nxt            =  LT(i, n) i                 :F(pp_wlast)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S85 # i
                        PUSH_VAR         .S30 # n
                        CALL_FN          .S87, 2 # LT
                        PUSH_VAR         .S85 # i
                        CONCAT
                        STORE_VAR        .S106 # nxt
                        JUMP_F           .L536
#=======================================================================================================================
# stmt 97  (line 114):                 pp_node(stk_c[f][i], indent + 2, ',')
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S8 # stk_c
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S85 # i
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S94 # indent
                        PUSH_INT         2
                        ADD_NUM
                        PUSH_STR         .S107, 0 # ","
                        CALL_FN          .S92, 3 # pp_node
                        VOID_POP
#=======================================================================================================================
# stmt 98  (line 115):                 i              =  i                          :(pp_wch)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S85 # i
                        STORE_VAR        .S85 # i
                        JUMP             .L501
.L536:                  LABEL
#=======================================================================================================================
# stmt 99  (line 116):  pp_wlast       pp_node(stk_c[f][i], indent + 2, ')' suffix) :(RETURN)
#=======================================================================================================================
.L537:                  STNO
                        PUSH_VAR         .S8 # stk_c
                        PUSH_VAR         .S73 # f
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S85 # i
                        CALL_FN          .S23, 2 # IDX
                        PUSH_VAR         .S94 # indent
                        PUSH_INT         2
                        ADD_NUM
                        PUSH_STR         .S44, 0 # ")"
                        PUSH_VAR         .S96 # suffix
                        CONCAT
                        CALL_FN          .S92, 3 # pp_node
                        VOID_POP
                        RETURN
.L552:                  LABEL
#=======================================================================================================================
# stmt 100  (line 117):  pp_wdone                                                    :(RETURN)
#=======================================================================================================================
.L553:                  STNO
                        RETURN
.L555:                  LABEL
#=======================================================================================================================
# stmt 101  (line 119):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L556:                  STNO
#=======================================================================================================================
# stmt 102  (line 120):                 DEFINE('pp_bank()')                          :(pp_bank_end)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S111, 0 # "pp_bank()"
                        CALL_FN          .S10, 1 # DEFINE
                        VOID_POP
                        JUMP             .L574
                        LABEL
#=======================================================================================================================
# stmt 103  (line 121):  pp_bank        pp_node(bank, 0, '')
#=======================================================================================================================
.L563:                  STNO
                        PUSH_VAR         .S113 # bank
                        PUSH_INT         0
                        PUSH_STR         .S40, 0 # ""
                        CALL_FN          .S92, 3 # pp_node
                        VOID_POP
#=======================================================================================================================
# stmt 104  (line 122):                 pp_bank        =  .dummy                     :(RETURN)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S16, 0 # "dummy"
                        CALL_FN          .S17, 1 # NAME_PUSH
                        STORE_VAR        .S112 # pp_bank
                        RETURN
.L574:                  LABEL
#=======================================================================================================================
# stmt 105  (line 124):  *------------------------------------------------------------------------------
#=======================================================================================================================
.L575:                  STNO
#=======================================================================================================================
# stmt 106  (line 125):                 delim          =  SPAN(' ' nl)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S93, 0 # " "
                        PUSH_VAR         .S0 # nl
                        CONCAT
                        PAT_SPAN
                        PAT_BOXVAL
                        STORE_VAR        .S115 # delim
#=======================================================================================================================
# stmt 107  (line 126):                 word           =  NOTANY('( )' nl) BREAK('( )' nl)
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S116, 0 # "( )"
                        PUSH_VAR         .S0 # nl
                        CONCAT
                        PAT_NOTANY
                        PAT_BOXVAL
                        PUSH_STR         .S116, 0 # "( )"
                        PUSH_VAR         .S0 # nl
                        CONCAT
                        PAT_BREAK
                        PAT_BOXVAL
                        CONCAT
                        STORE_VAR        .S117 # word
#=======================================================================================================================
# stmt 108  (line 128):                 group          =
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S118, 0 # "("
                        PUSH_VAR         .S117 # word
                        PAT_DEREF
                        PAT_CAPTURE      0, .S82 # tag kind=0
                        PAT_BOXVAL
                        PUSH_STR         .S82, 0 # "tag"
                        CALL_FN          .S50, 1 # Push_list
                        PAT_REFNAME      .S115 # delim
                        PAT_REFNAME      .S119 # group
                        PUSH_VAR         .S117 # word
                        PAT_DEREF
                        PAT_CAPTURE      0, .S120 # wrd kind=0
                        PUSH_STR         .S120, 0 # "wrd"
                        CALL_FN          .S56, 1 # Push_item
                        PAT_DEREF
                        PAT_CAT
                        PAT_ALT
                        PAT_CAT
                        PAT_ARBNO
                        PAT_BOXVAL
                        CALL_FN          .S62, 0 # Pop_list
                        PUSH_STR         .S44, 0 # ")"
                        CONCAT
                        CONCAT
                        CONCAT
                        CONCAT
                        CONCAT
                        STORE_VAR        .S119 # group
#=======================================================================================================================
# stmt 109  (line 140):                 spat           =  ('(' BAL ')') . item
#=======================================================================================================================
                        STNO
                        PAT_LIT          .S118 # arg="("
                        PUSH_VAR         .S121 # BAL
                        PAT_DEREF
                        PAT_LIT          .S44 # arg=")"
                        PAT_CAT
                        PAT_CAT
                        PAT_CAPTURE      0, .S122 # item kind=0
                        PAT_BOXVAL
                        STORE_VAR        .S123 # spat
.L635:                  LABEL
#=======================================================================================================================
# stmt 110  (line 142):  slurp          line           =  INPUT                      :F(slurp_done)
#=======================================================================================================================
.L636:                  STNO
                        PUSH_VAR         .S125 # INPUT
                        STORE_VAR        .S126 # line
                        JUMP_F           .L648
#=======================================================================================================================
# stmt 111  (line 143):                 src            =  src line nl                :(slurp)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S127 # src
                        PUSH_VAR         .S126 # line
                        PUSH_VAR         .S0 # nl
                        CONCAT
                        CONCAT
                        STORE_VAR        .S127 # src
                        JUMP             .L635
.L648:                  LABEL
#=======================================================================================================================
# stmt 112  (line 145):                 dummy          =  init_list('bank')
#=======================================================================================================================
.L649:                  STNO
#=======================================================================================================================
# stmt 113  (line 145):                 dummy          =  init_list('bank')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S113, 0 # "bank"
                        CALL_FN          .S39, 1 # init_list
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 114  (line 146):                 dummy          =  stk_push_frame('BANK')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S129, 0 # "BANK"
                        CALL_FN          .S11, 1 # stk_push_frame
                        STORE_VAR        .S16 # dummy
.L658:                  LABEL
#=======================================================================================================================
# stmt 115  (line 147):  loop           src            spat =  ''                    :F(all_done)
#=======================================================================================================================
.L659:                  STNO
                        PUSH_VAR         .S123 # spat
                        PAT_DEREF
                        PUSH_VAR         .S127 # src
                        PUSH_STR         .S40, 0 # ""
                        EXEC_STMT_VARIANT 1, .S127 # subj=src
                        JUMP_F           .L691
#=======================================================================================================================
# stmt 116  (line 148):                 dummy          =  stk_push_frame('ROOT')
#=======================================================================================================================
                        STNO
                        PUSH_STR         .S131, 0 # "ROOT"
                        CALL_FN          .S11, 1 # stk_push_frame
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 117  (line 149):                 item           group                         :F(parse_fail)
#=======================================================================================================================
                        STNO
                        PUSH_VAR         .S119 # group
                        PAT_DEREF
                        PUSH_VAR         .S122 # item
                        PUSH_INT         0
                        EXEC_STMT_VARIANT 0, .S122 # subj=item
                        JUMP_F           .L681
#=======================================================================================================================
# stmt 118  (line 150):                 dummy          =  stk_pop_into_parent()      :(loop)
#=======================================================================================================================
                        STNO
                        CALL_FN          .S26, 0 # stk_pop_into_parent
                        STORE_VAR        .S16 # dummy
                        JUMP             .L658
.L681:                  LABEL
#=======================================================================================================================
# stmt 119  (line 151):  parse_fail     OUTPUT         =  'Parse failed on: ' item
#=======================================================================================================================
.L682:                  STNO
                        PUSH_STR         .S133, 0 # "Parse failed on: "
                        PUSH_VAR         .S122 # item
                        CONCAT
                        STORE_VAR        .S97 # OUTPUT
#=======================================================================================================================
# stmt 120  (line 152):                 dummy          =  stk_pop_into_parent()      :(loop)
#=======================================================================================================================
                        STNO
                        CALL_FN          .S26, 0 # stk_pop_into_parent
                        STORE_VAR        .S16 # dummy
                        JUMP             .L658
.L691:                  LABEL
#=======================================================================================================================
# stmt 121  (line 153):  all_done       dummy          =  stk_pop_final('bank')
#=======================================================================================================================
.L692:                  STNO
                        PUSH_STR         .S113, 0 # "bank"
                        CALL_FN          .S33, 1 # stk_pop_final
                        STORE_VAR        .S16 # dummy
#=======================================================================================================================
# stmt 122  (line 154):                 dummy          =  pp_bank()                  :(END)
#=======================================================================================================================
                        STNO
                        CALL_FN          .S112, 0 # pp_bank
                        STORE_VAR        .S16 # dummy
                        JUMP             .L700
.L700:                  LABEL
#=======================================================================================================================
# stmt 123
#=======================================================================================================================
.L701:                  STNO
                        HALT
#-- epilogue -------------------------------------------
                        call             rt_finalize@PLT
                        pop              rbp
                        ret
                        .size            main, .-main
                        .section         .note.GNU-stack,"",@progbits
